artchula/fw-nrf52832-learning/nRF5_SDK_14.1.0/components/drivers_ext/ssd1306_driver/ssd1306.c
void ssd1306_set_textwrap(bool w)
{
    wrap = w;
}

uint8_t ssd1306_get_rotation(void)
{
    return rotation;
}

void ssd1306_set_rotation(uint8_t x)
{
    rotation = (x & 3);
    switch (rotation) {
    case 0:
    case 2:
        _width  = WIDTH;
        _height = HEIGHT;
        break;
    case 1:
    case 3:
        _width  = HEIGHT;
        _height = WIDTH;
        break;
    }
}

// Enable (or disable) Code Page 437-compatible charset.
// There was an error in glcdfont.c for the longest time -- one character
// (#176, the 'light shade' block) was missing -- this threw off the index
// of every character that followed it.  But a TON of code has been written
// with the erroneous character indices.  By default, the library uses the
// original 'wrong' behavior and old sketches will still work.  Pass 'true'
// to this function to use correct CP437 character values in your code.
void ssd1306_cp437(bool x)
{
    _cp437 = x;
}


void ssd1306_putstring(char* buffer)
{
    while (*buffer) {
        ssd1306_write((uint8_t)*buffer);
        buffer++;
    }
}

void ssd1306_puts(char* buffer)
{
    ssd1306_putstring(buffer);
    ssd1306_write('\n');
}


/***************************************************************************************
** Function name:           drawUnicode
** Descriptions:            draw a unicode
***************************************************************************************/
int ssd1306_drawUnicode(unsigned int uniCode, int x, int y, int size)
{

		if (size) uniCode -= 32;

		unsigned int width = 0;
		unsigned int height = 0;
		uint32_t flash_address = 0;
		int8_t gap = 0;

//   if (size == 1) {
//     flash_address = pgm_read_word(&chrtbl_f8[uniCode]);
//     width = pgm_read_byte(widtbl_f8+uniCode);
//     height = chr_hgt_f8;
//     gap = 1;
//   }
#ifdef LOAD_FONT2
		if (size == 2) {
				flash_address = (uint32_t)chrtbl_f16[uniCode] ;
				width = pgm_read_byte(widtbl_f16+uniCode);
				height = chr_hgt_f16;
				gap = 1;
		}
#endif
//   if (size == 3) {
//     flash_address = pgm_read_word(&chrtbl_f24[uniCode]);
//     width = pgm_read_byte(widtbl_f24+uniCode);
//     height = chr_hgt_f24;
//     gap = 0;
//   }
#ifdef LOAD_FONT4
		if (size == 4) {
				flash_address = (uint32_t)chrtbl_f32[uniCode];
				width = pgm_read_byte(widtbl_f32+uniCode);
				height = chr_hgt_f32;
				gap = -3;
			
				//uint32_t buf_address = &chrtbl_f32[uniCode];
				
			  //NRF_LOG_INFO("\n uniCode %d , Flash_address ld ", uniCode, flash_address);
		}
#endif
//   if (size == 5) {
//     flash_address = pgm_read_word(&chrtbl_f48[uniCode]);
//     width = pgm_read_byte(widtbl_f48+uniCode);
//     height = chr_hgt_f48;
//     gap = -3;
//   }
#ifdef LOAD_FONT6
		if (size == 6) 
		{
				flash_address = (uint32_t)chrtbl_f64[uniCode];
				width = pgm_read_byte(widtbl_f64+uniCode);
				height = chr_hgt_f64;
				gap = -3;
			  
			  //NRF_LOG_INFO("\n uniCode %d , Flash_address ld ", uniCode, flash_address);
			
		}
#endif
#ifdef LOAD_FONT7
		if (size == 7) 
		{
				flash_address = (uint32_t)chrtbl_f7s[uniCode];
				width = pgm_read_byte(widtbl_f7s+uniCode);
				height = chr_hgt_f7s;
				gap = 2;
		}
#endif

		int w = (width+7)/8;
		int pX      = 0;
		int pY      = y;
		uint8_t line = 0;
		for(int i=0; i<height; i++)
		{
				if (textcolor != textbgcolor) 
				{
						if (textsize == 1) ssd1306_draw_fast_hline(x, pY, width+gap, textbgcolor);
						else ssd1306_fill_rect(x, pY, (width+gap)*textsize, textsize, textbgcolor);
				}   
				
				for (int k = 0;k < w; k++)
				{ 
						line = pgm_read_byte(flash_address+w*i+k);
						if(line) {
								if (textsize==1)
								{
										pX = x + k*8;
										if(line & 0x80) ssd1306_draw_pixel(pX, pY, textcolor);
										if(line & 0x40) ssd1306_draw_pixel(pX+1, pY, textcolor);
										if(line & 0x20) ssd1306_draw_pixel(pX+2, pY, textcolor);
										if(line & 0x10) ssd1306_draw_pixel(pX+3, pY, textcolor);
										if(line & 0x8) ssd1306_draw_pixel(pX+4, pY, textcolor);
										if(line & 0x4) ssd1306_draw_pixel(pX+5, pY, textcolor);
										if(line & 0x2) ssd1306_draw_pixel(pX+6, pY, textcolor);
										if(line & 0x1) ssd1306_draw_pixel(pX+7, pY, textcolor);
								}
								else{
										pX = x + k*8*textsize;
										if(line & 0x80) ssd1306_fill_rect(pX, pY, textsize, textsize, textcolor);
										if(line & 0x40) ssd1306_fill_rect(pX+textsize, pY, textsize, textsize, textcolor);
										if(line & 0x20) ssd1306_fill_rect(pX+2*textsize, pY, textsize, textsize, textcolor);
										if(line & 0x10) ssd1306_fill_rect(pX+3*textsize, pY, textsize, textsize, textcolor);
										if(line & 0x8) ssd1306_fill_rect(pX+4*textsize, pY, textsize, textsize, textcolor);
										if(line & 0x4) ssd1306_fill_rect(pX+5*textsize, pY, textsize, textsize, textcolor);
										if(line & 0x2) ssd1306_fill_rect(pX+6*textsize, pY, textsize, textsize, textcolor);
										if(line & 0x1) ssd1306_fill_rect(pX+7*textsize, pY, textsize, textsize, textcolor);
								}
						}
				}
				pY+=textsize;
		}
		return (width+gap)*textsize;        // x +
}

/***************************************************************************************
** Function name:           ssd1306_drawNumber unsigned with size
** Descriptions:            ssd1306_drawNumber
***************************************************************************************/
int ssd1306_drawNumber(long long_num,int poX, int poY, int size)
{
    char tmp[10];
    if (long_num < 0) sprintf(tmp, "%li", long_num);
    else sprintf(tmp, "%lu", long_num);
    return ssd1306_drawString(tmp, poX, poY, size);
}

/***************************************************************************************
** Function name:           ssd1306_drawChar
** Descriptions:            draw char
***************************************************************************************/
int ssd1306_drawChar(char c, int x, int y, int size)
{
    return ssd1306_drawUnicode(c, x, y, size);
}

/***************************************************************************************
** Function name:           ssd1306_drawString
** Descriptions:            draw string
***************************************************************************************/
int ssd1306_drawString(char *string, int poX, int poY, int size)
{
    int sumX = 0;

    while(*string)
    {
        int xPlus = ssd1306_drawChar(*string, poX, poY, size);
        sumX += xPlus;
        *string++;
        poX += xPlus;                            /* Move cursor right       */
    }
    return sumX;
}

/***************************************************************************************
** Function name:           ssd1306_drawCentreString
** Descriptions:            draw string across centre
***************************************************************************************/
int ssd1306_drawCentreString(char *string, int dX, int poY, int size)
{
    int sumX = 0;
    int len = 0;
    char *pointer = string;
    char ascii;

